# FileSaveDialog Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FileSaveDialog Methods
FileSaveDialog Class See Also
---
The FileSaveDialog type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from FileDialog.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSelectedModelPath | Returns the selected file path chosen by the user.  (Inherited from FileDialog.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Show | Shows the dialog using the stored settings.  (Inherited from FileDialog.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FileSaveDialog Class
Autodesk.Revit.UI Namespace